## Step 1. Import the necessary libraries

In [15]:
import pandas as pd

## Step 2. Import the dataset from this address.

In [2]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

## Step 3. Assign it to a variable called baby_names.

In [16]:
baby_names = pd.read_csv(url)

## Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

## Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
del baby_names['Unnamed: 0']
del baby_names['Id']

## Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

## Step 7. Group the dataset by name and assign to names

In [7]:
names = baby_names.groupby('Name')

## Step 8. How many different names exist in the dataset?

In [8]:
names = baby_names.groupby('Name').sum()
len(names)

17632

## Step 9. What is the name with most occurrences?

In [9]:
del names['Year']
names[names['Count'] == names['Count'].max()]

,Gender,State,Count
Name,,,
Jacob,MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM...,AKAKAKAKAKAKAKAKAKAKAKALALALALALALALALALALALAR...,242874

## Step 10. How many different names have the least occurrences?

In [10]:
len(names[names['Count'] == names['Count'].min()])

2578

## Step 11. What is the median name occurrence?

In [11]:
names[names['Count'] == names['Count'].median()]

           Gender             State  Count
Name
Aishani   FFFFFFF    CACACACACAILNJ     49
Alara    FFFFFFFF  CACACAFLNYNYNYTX     49
Alysse   FFFFFFFF  CACACAMINYTXTXTX     49
Ameir    MMMMMMMM  CAMIMIMIMIMINYOH     49
Anely    FFFFFFFF  CACACACACACACACA     49
...           ...               ...    ...
Sriram    MMMMMMM    CACACACACACATX     49
Trinton  MMMMMMMM  FLLAOKTXTXTXTXTX     49
Vita      FFFFFFF    CACACACACANYNY     49
Yoni     MMMMMMMM  CACACACACACAFLFL     49
Zuleima   FFFFFFF    AZCACACACACACA     49

[66 rows x 3 columns]

## Step 12. What is the standard deviation of names?

In [12]:
names['Count'].std()

11006.06946789057

## Step 13. Get a summary with the mean, min, max, std and quartiles.

In [14]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000